app/controllers/calendar_controller.rb

  def show
    @date = params[:date] ? Date.parse(params[:date]) : Date.today
    @events_by_date = Event.group(@date.)
---
SELECT "events".* FROM "events" GROUP BY '2014-03-08'