app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
	def new
		@event = Event.new
		@events = Event.all

SELECT "events".* FROM "events"
INSERT INTO "events" ("created_at", "date", "description", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 09 May 2014 22:53:33 UTC +00:00], ["date", Fri, 05 Sep 2014], ["description", "asdfasdfasdfsadf"], ["title", "TESTING"], ["updated_at", Fri, 09 May 2014 22:53:33 UTC +00:00]]
---
	def create
	  @event = Event.new(event_params)
	  @events = Event.all

	  respond_to do |format|
	    if @event.save