app/controllers/home_controller.rb

SELECT "events".* FROM "events" GROUP BY 1394236800
---
  def index
    @date = params[:date] ? Date.parse(params[:date]) : Date.today
    @events_by_date = Event.group(@date.wday)